## Production: alarms 🚨
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                       |
|--------|-------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.glue_job_failures` |
| delete | `aws_cloudwatch_event_target.glue_job_failure`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.glue_job_failure will be destroyed
  # (because aws_cloudwatch_event_target.glue_job_failure is not in configuration)
  - resource "aws_cloudwatch_event_target" "glue_job_failure" {
      - arn            = "arn:aws:sns:ca-central-1:739275439843:cloudwatch-alarm-action" -> null
      - event_bus_name = "default" -> null
      - force_destroy  = false -> null
      - id             = "glue-job-failures-send-to-sns" -> null
      - rule           = "glue-job-failures" -> null
      - target_id      = "send-to-sns" -> null
        # (3 unchanged attributes hidden)

      - input_transformer {
          - input_paths    = {
              - "jobName" = "$.detail.jobName"
              - "message" = "$.detail.message"
              - "state"   = "$.detail.state"
            } -> null
          - input_template = jsonencode(
                {
                  - Message = jsonencode(
                        {
                          - AWSAccountId     = "739275439843"
                          - AlarmArn         = "arn:aws:cloudwatch:ca-central-1:739275439843:alarm:glue-job-failure"
                          - AlarmDescription = "`<state>` detected for Glue job `<jobName>`"
                          - AlarmName        = "glue-job-failure"
                          - NewStateReason   = "<message>"
                          - NewStateValue    = "ALARM"
                          - OldStateValue    = "OK"
                        }
                    )
                }
            ) -> null
        }
    }

  # aws_cloudwatch_metric_alarm.glue_job_failures will be created
  + resource "aws_cloudwatch_metric_alarm" "glue_job_failures" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:739275439843:cloudwatch-alarm-action",
        ]
      + alarm_description                     = "Glue Job state has changed to `FAILURE`, `TIMEOUT` or `ERROR`."
      + alarm_name                            = "glue-job-failures"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "RuleName" = "glue-job-failures"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Invocations"
      + namespace                             = "AWS/Events"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:739275439843:cloudwatch-ok-action",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.glue_job_failure"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_crawler_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_job_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_alarm_action"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_ok_action"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
